{"url": "https://huggingface.co/posts", "title": "Hugging Face – Posts", "text": "       Hugging Face        Models  Datasets  Spaces  Posts  Docs     Solutions   Pricing        Log In  Sign Up     Join the conversation  Join the community of Machine Learners and AI enthusiasts.  Sign Up  All HF Hub posts     Sort: \n\t\tTrending           isidentical    posted an update  about 14 hours ago   view post  Post  590   Reply         Introducing  fal/AuraFace-v1 : Commercially available & open source identity encoder model for next generation one shot personalization. Read more about it here: https://huggingface.co/blog/isidentical/auraface      🚀  9  9     🔥  4  4     🤗  1  1     ❤️  1  1     🧠  1  1     😎  1  1     +           clem    posted an update  about 22 hours ago   view post  Post  1141   Reply         Just crossed 200,000 free public AI datasets shared by the community on Hugging Face! Text, image, video, audio, time-series & many more... Thanks everyone! http://hf.co/datasets       🔥  8  8     +           maximuspowers    posted an update  1 day ago   view post  Post  1455   Reply         Here's my favorite piece of the summer bias detection research project (paper coming in Sept). We trained BERT for token classification (multi-label), to identify: - Generalizations - Unfairness - Stereotypes HF Space:  maximuspowers/bias-detection-ner Article on Training: https://huggingface.co/blog/maximuspowers/bias-entity-recognition Pls reach out with ideas!! Lot's more info coming soon, our research group has workshops and a hackathon planned for launching this open source project. Thanks       👀  4  4     🚀  4  4     +           TuringsSolutions    posted an update  1 day ago   view post  Post  1592   Reply         I developed a way to test very clearly whether or not a Transformers model can actually learn symbolic reasoning, or if LLM models are forever doomed to be offshoots of 'Socratic Parrots'. The results are in, undeniable proof that Transformers models CAN learn symbolic relationships. Undeniable proof that AI can learn its ABC's. Credit goes to myself, Claude, and ChatGPT. I would not be able to prove this without Claude or ChatGPT. https://www.youtube.com/watch?v=I8jHRgahRfY       👍  5  5     👀  2  2     +           Xenova    posted an update  4 days ago   view post  Post  3859   Reply         I can't believe this... Phi-3.5-mini (3.8B) running in-browser at ~90 tokens/second on WebGPU w/ Transformers.js and ONNX Runtime Web! 🤯 Since everything runs 100% locally, no messages are sent to a server — a huge win for privacy! - 🤗 Demo:  webml-community/phi-3.5-webgpu - 🧑‍💻 Source code: https://github.com/huggingface/transformers.js-examples/tree/main/phi-3.5-webgpu                7 replies  ·   🔥  20  20     🚀  5  5     😔  1  1     ❤️  1  1     👀  1  1     +           vikhyatk    posted an update  about 8 hours ago   view post  Post  411   Reply         Pushed a new update to  vikhyatk/moondream2 today. TextVQA up from 60.2 to 65.2, DocVQA up from 61.9 to 70.5. Space has been updated to the new model if you want to try it out!  vikhyatk/moondream2       🔥  5  5     +           hlky    posted an update  1 day ago   view post  Post  1254   Reply         florence-tool ( https://github.com/bigdata-pw/florence-tool ) now supports WebDataset! Check it out for efficient batch inference with Florence-2 models  microsoft/Florence-2-large   microsoft/Florence-2-base Currently running it myself on A40 with CAPTION task and a streaming WebDataset @ 60k images/hour!      🔥  5  5     +           codelion    posted an update  about 13 hours ago   view post  Post  467   Reply         We recently worked with OpenAI to fine-tune gpt-4o and built the SOTA model for the  patched-codes/static-analysis-eval benchmark. All the code and data  patched-codes/synth-vuln-fixes on how we did it is available on their GitHub - https://github.com/openai/build-hours/tree/main/5-4o_fine_tuning . Here are some tips based on our experience: → Establish baseline with \"conditioning\" / prompting → Task-specific datasets are ideal for PEFT; hard to beat gpt-4o on \"broad\" tasks → Add your best system prompt to each example → Ensure training data distribution is similar to inference data → Shorten instructions with concise prompts; may require more examples. → Define clear evaluation metrics (seriously, please eval!) You can see more details on the benchmark and process here - https://www.patched.codes/blog/the-static-analysis-evaluation-benchmark-measuring-llm-performance-in-fixing-software-vulnerabilities      ❤️  3  3     👀  2  2     🚀  1  1     🔥  1  1     🤗  1  1     ➕  1  1     +           jjokah    posted an update  3 days ago   view post  Post  1644   Reply         🔗 Neural Network  (1 Byte explainer for everybody) Just like our brain, a Neural Network is made up of interconnected \"neurons\". These neurons work together by learning from (input) data and getting better at tasks (in the hidden layer) to give (output) predictions or decisions.      👍  6  6     +           merve    posted an update  3 days ago   view post  Post  2598   Reply         a new shape-optimized SigLIP just dropped 👀  google/siglip-so400m-patch14-224      🔥  7  7     🚀  4  4     🤗  1  1     😎  1  1     +      Load more   Recently active users      TuringsSolutions    Richard A Aragon  Follow       clem    Clem 🤗  Follow       isidentical    Batuhan  Follow       Xenova    Joshua  Follow       maximuspowers    Maximus Powers  Follow       vikhyatk    vik  Follow       hlky    hlky  Follow       jjokah    John Johnson  Follow       codelion    Asankhaya Sharma  Follow       merve    Merve Noyan  Follow     Company  © Hugging Face  TOS  Privacy  About  Jobs   Website  Models  Datasets  Spaces  Pricing  Docs     "}