{"url": "https://huggingface.co/google-t5/t5-base", "title": "google-t5/t5-base · Hugging Face", "text": "       Hugging Face        Models  Datasets  Spaces  Posts  Docs     Solutions   Pricing        Log In  Sign Up      google-t5  /  t5-base     like  543    Translation   Transformers   PyTorch   TensorFlow   JAX   Rust   Safetensors       c4       4 languages   t5   text2text-generation   summarization    text-generation-inference    Inference Endpoints     8 papers      License:  apache-2.0     Model card  Files  Files and versions  Community 27           Train      Deploy      Use this model      Edit model card      Model Card for T5 Base   Table of Contents   Model Details  Model Description    Uses  Direct Use and Downstream Use   Out-of-Scope Use    Bias, Risks, and Limitations  Recommendations    Training Details  Training Data   Training Procedure    Evaluation  Testing Data, Factors & Metrics   Results    Environmental Impact   Citation   Model Card Authors   How to Get Started with the Model          Model Card for T5 Base        Table of Contents    Model Details  Uses  Bias, Risks, and Limitations  Training Details  Evaluation  Environmental Impact  Citation  Model Card Authors  How To Get Started With the Model       Model Details       Model Description   The developers of the Text-To-Text Transfer Transformer (T5) write :   With T5, we propose reframing all NLP tasks into a unified text-to-text-format where the input and output are always text strings, in contrast to BERT-style models that can only output either a class label or a span of the input. Our text-to-text framework allows us to use the same model, loss function, and hyperparameters on any NLP task.   T5-Base is the checkpoint with 220 million parameters.   Developed by: Colin Raffel, Noam Shazeer, Adam Roberts, Katherine Lee, Sharan Narang, Michael Matena, Yanqi Zhou, Wei Li, Peter J. Liu. See associated paper and GitHub repo  Model type: Language model  Language(s) (NLP): English, French, Romanian, German  License: Apache 2.0  Related Models:  All T5 Checkpoints  Resources for more information:  Research paper  Google's T5 Blog Post   GitHub Repo  Hugging Face T5 Docs         Uses       Direct Use and Downstream Use   The developers write in a blog post that the model:   Our text-to-text framework allows us to use the same model, loss function, and hyperparameters on any NLP task, including machine translation, document summarization, question answering, and classification tasks (e.g., sentiment analysis). We can even apply T5 to regression tasks by training it to predict the string representation of a number instead of the number itself.   See the blog post and research paper for further details.      Out-of-Scope Use   More information needed.      Bias, Risks, and Limitations   More information needed.      Recommendations   More information needed.      Training Details       Training Data   The model is pre-trained on the Colossal Clean Crawled Corpus (C4) , which was developed and released in the context of the same research paper as T5.  The model was pre-trained on a on a multi-task mixture of unsupervised (1.) and supervised tasks (2.) .\nThereby, the following datasets were being used for (1.) and (2.):   Datasets used for Unsupervised denoising objective :    C4  Wiki-DPR    Datasets used for Supervised text-to-text language modeling objective    Sentence acceptability judgment  CoLA Warstadt et al., 2018    Sentiment analysis  SST-2 Socher et al., 2013    Paraphrasing/sentence similarity  MRPC Dolan and Brockett, 2005  STS-B Ceret al., 2017  QQP Iyer et al., 2017    Natural language inference  MNLI Williams et al., 2017  QNLI Rajpurkar et al.,2016  RTE Dagan et al., 2005   CB De Marneff et al., 2019    Sentence completion  COPA Roemmele et al., 2011    Word sense disambiguation  WIC Pilehvar and Camacho-Collados, 2018    Question answering  MultiRC Khashabi et al., 2018  ReCoRD Zhang et al., 2018  BoolQ Clark et al., 2019         Training Procedure   In their abstract , the model developers write:   In this paper, we explore the landscape of transfer learning techniques for NLP by introducing a unified framework that converts every language problem into a text-to-text format. Our systematic study compares pre-training objectives, architectures, unlabeled datasets, transfer approaches, and other factors on dozens of language understanding tasks.   The framework introduced, the T5 framework, involves a training procedure that brings together the approaches studied in the paper. See the research paper for further details.      Evaluation       Testing Data, Factors & Metrics   The developers evaluated the model on 24 tasks, see the research paper for full details.      Results   For full results for T5-Base, see the research paper , Table 14.      Environmental Impact   Carbon emissions can be estimated using the Machine Learning Impact calculator presented in Lacoste et al. (2019) .   Hardware Type: Google Cloud TPU Pods  Hours used: More information needed  Cloud Provider: GCP  Compute Region: More information needed  Carbon Emitted: More information needed       Citation   BibTeX:  @article{2020t5,\n  author  = {Colin Raffel and Noam Shazeer and Adam Roberts and Katherine Lee and Sharan Narang and Michael Matena and Yanqi Zhou and Wei Li and Peter J. Liu},\n  title   = {Exploring the Limits of Transfer Learning with a Unified Text-to-Text Transformer},\n  journal = {Journal of Machine Learning Research},\n  year    = {2020},\n  volume  = {21},\n  number  = {140},\n  pages   = {1-67},\n  url     = {http://jmlr.org/papers/v21/20-074.html}\n}  APA:   Raffel, C., Shazeer, N., Roberts, A., Lee, K., Narang, S., Matena, M., ... & Liu, P. J. (2020). Exploring the limits of transfer learning with a unified text-to-text transformer. J. Mach. Learn. Res., 21(140), 1-67.       Model Card Authors   This model card was written by the team at Hugging Face.      How to Get Started with the Model   Use the code below to get started with the model.   Click to expand  from transformers import T5Tokenizer, T5Model\n\ntokenizer = T5Tokenizer.from_pretrained( \"t5-base\" )\nmodel = T5Model.from_pretrained( \"t5-base\" )\n\ninput_ids = tokenizer( \"Studies have been shown that owning a dog is good for you\" , return_tensors= \"pt\" ).input_ids # Batch size 1 decoder_input_ids = tokenizer( \"Studies show that\" , return_tensors= \"pt\" ).input_ids # Batch size 1  # forward pass outputs = model(input_ids=input_ids, decoder_input_ids=decoder_input_ids)\nlast_hidden_states = outputs.last_hidden_state  See the Hugging Face T5 docs and a Colab Notebook created by the model developers for more examples.    Downloads last month 3,871,588               Safetensors  Model size  223M params  Tensor type  F32 ·      Inference API    warm     Translation     Examples         Compute         View Code   Maximize    Model tree for google-t5/t5-base     Adapters   35 models    Finetunes   319 models    Merges   1 model    Quantizations   1 model    Dataset used to train google-t5/t5-base   legacy-datasets/c4    Updated Mar 5  •  59 •  229    Spaces using google-t5/t5-base  100  🎵  facebook/MusicGen 🏆  eduagarcia/open_pt_llm_leaderboard 🎶  GrandaddyShmax/AudioCraft_Plus 🥇  vectara/leaderboard 🔥  amphion/Text-to-Speech 🌖  amphion/Text-to-Audio 🤖  Xenova/sponsorblock-ml 🎵  GrandaddyShmax/MusicGen_Plus 🔥  unpairedelectron07/Text-to-Music-Generator 🪄  TencentARC/ImageConductor 🎐  taesiri/HuggingGPT-Lite ☯️  radinhas/hf-llm-api  + 95 Spaces  + 88 Spaces    Company  © Hugging Face  TOS  Privacy  About  Jobs   Website  Models  Datasets  Spaces  Pricing  Docs     "}