{"url": "https://huggingface.co/", "title": "Hugging Face – The AI community building the future.", "text": "       Hugging Face        Models  Datasets  Spaces  Posts  Docs     Solutions   Pricing        Log In  Sign Up   NEW  AI Tools are now available in HuggingChat   The AI community building the future.  The platform where the machine learning community collaborates on models, datasets, and applications.       Trending on this week   Models   black-forest-labs/FLUX.1-dev    Updated 11 days ago  •  507k •  3.25k   microsoft/Phi-3.5-MoE-instruct    Updated 6 days ago  •  12.5k •  399   microsoft/Phi-3.5-mini-instruct    Updated 5 days ago  •  61.1k •  349   microsoft/Phi-3.5-vision-instruct    Updated 3 days ago  •  18.7k •  323   black-forest-labs/FLUX.1-schnell    Updated 11 days ago  •  1.58M •  1.89k   Browse 400k+ models  Spaces     Running on  Zero     2.45k  🖥️  FLUX.1 [dev]      Running on  Zero     775  🏆  FLUX LoRa the Explorer      Running on  Zero     354  👕  Kolors Virtual Try-On      Running on  Zero     2.37k  🏎️💨  FLUX.1 [Schnell]      Running on  Zero     408  🌘w🌖  Background Removal    Browse 150k+ applications  Datasets   fka/awesome-chatgpt-prompts    Updated Mar 7, 2023  •  5.91k •  5.42k   BAAI/Infinity-Instruct    Updated 13 days ago  •  2.55k •  418   THUDM/LongWriter-6k    Updated 13 days ago  •  375 •  98   nisten/all-human-diseases    Updated 8 days ago  •  66 •  94   HuggingFaceTB/everyday-conversations-llama3.1-2k    Updated 9 days ago  •  808 •  43   Browse 100k+ datasets    The Home of Machine Learning   Create, discover and collaborate on ML better.  The collaboration platform  Host and collaborate on unlimited models, datasets and applications.    Move faster  With the HF Open source stack.    Explore all modalities  Text, image, video, audio or even 3D.   Build your portfolio  Share your work with the world and build your ML profile.  Sign Up     Accelerate your ML   We provide paid Compute and Enterprise solutions.  Compute  Deploy on optimized Inference Endpoints or update your Spaces applications to a GPU in a few clicks.  View pricing  Starting at $0.60/hour for GPU   Enterprise  Give your team the most advanced platform to build AI with enterprise-grade security, access controls and\n\t\t\tdedicated support.  Getting started  Starting at $20/user/month  Single Sign-On Regions Priority Support Audit Logs Resource Groups Private Datasets Viewer         More than 50,000 organizations are using Hugging Face    Ai2   non-profit  • 322 models   AI at Meta  Enterprise  company  • 1945 models   Amazon Web Services   company  • 17 models   Google   company  • 860 models   Intel   company  • 198 models   Microsoft   company  • 331 models   Grammarly   company  • 10 models   Writer  Enterprise  company  • 17 models      Our Open Source   We are building the foundation of ML tooling with the community.   Transformers   131,179  State-of-the-art ML for Pytorch, TensorFlow, and JAX.   Diffusers   24,850  State-of-the-art diffusion models for image and audio generation in PyTorch.   Safetensors   2,712  Simple, safe way to store and distribute neural networks weights safely and quickly.   Hub Python Library   1,941  Client library for the HF Hub: manage repositories from your Python runtime.   Tokenizers   8,842  Fast tokenizers, optimized for both research and production.   PEFT   15,584  Parameter efficient finetuning methods for large models.   Transformers.js   10,726  Community library to run pretrained models from Transformers in your browser.   timm   31,244  State-of-the-art computer vision models, layers, optimizers, training/evaluation, and utilities.   TRL   9,114  Train transformer language models with reinforcement learning.   Datasets   18,921  Access and share datasets for computer vision, audio, and NLP tasks.   Text Generation Inference   8,647  Toolkit to serve Large Language Models.   Accelerate   7,572  Easily train and use PyTorch models with multi-GPU, TPU, mixed-precision.      Website  Models  Datasets  Spaces  Tasks  Inference Endpoints  HuggingChat  Company  About  Brand assets  Terms of service  Privacy  Jobs  Press  Resources  Learn  Documentation  Blog  Forum  Service Status  Social  GitHub  Twitter  LinkedIn  Discord      "}